[
  {
    "id": "p1",
    "title": "Santander Security Library",
    "description": "Redesign and modernization of the Santander Security Context Manager (SCM) library, a core security component integrated into Santander’s mobile applications. Built with modern Kotlin, Retrofit, Koin and Coroutines versions, it provides a robust and thread-safe foundation for secure operations across Santander’s mobile ecosystem.",
    "contribution": "Led the Android development of the SCM library through a complete architectural redesign and refactor. The library manages secure authentication workflows, credential orchestration, cryptographic verification, and token injection for HTTP and UDP request signatures. Implemented full thread safety, adaptive refresh handling for idle and Doze modes, and a restructured testing framework that evolved from a mock-heavy setup to a real-component-based strategy—enhancing reliability, stability, and long-term scalability.",
    "impact": "Collaborated closely with the iOS lead to unify and synchronize the development of both platform libraries, achieving major gains in maintainability, delivery efficiency, and cross-platform consistency. The modernized SCM library is now deployed in Santander Brazil’s production app, serving over 20 million active users and more than 300,000 daily active sessions, significantly improving authentication reliability and system uptime across critical user operations.",
    "logo": "logo_p1.webp",
    "images": [
      {
        "src": "image1_p1.jpg"
      },
      {
        "src": "image2_p1.jpg"
      },
      {
        "src": "image3_p1.jpg"
      }
    ],
    "url": "https://play.google.com/store/apps/details?id=com.santander.app"
  },
  {
    "id": "p2",
    "title": "Renta 4 Banco",
    "description": "The official mobile application for Renta 4 Banco, a leading investment bank specializing in capital markets and portfolio management. The app provides real-time quotes, financial insights, and trading tools for managing portfolios, funds, and assets, with a strong focus on performance, reliability, and user experience.",
    "contribution": "Collaborated with a cross-functional team to deliver the MVP under a tight schedule and later led the app’s evolution into production. Implemented new features, optimized real-time market data flows, and overhauled error-handling logic to enhance stability. Contributed to the Jetpack Compose migration to improve UI responsiveness and maintainability.",
    "impact": "Achieved a 68% reduction app crashes, improving overall stability and user satisfaction. Reduced data latency in live quote updates by over 40%, enabling faster and more accurate portfolio tracking. The app serves Renta 4 Banco’s client base of approximately 100,000 investors (as of 2022), reinforcing the bank’s position in the digital investment market.",
    "logo": "logo_p2.webp",
    "images": [
      {
        "src": "image1_p2.jpg"
      },
      {
        "src": "image2_p2.jpg"
      },
      {
        "src": "image3_p2.jpg"
      }
    ],
    "video": "video_p2.mp4",
    "url": "https://play.google.com/store/apps/details?id=com.r4.renta4"
  },
  {
    "id": "p3",
    "title": "InOne App",
    "description": "A redesigned version of the CaixaBank Payments & Consumer app, leveraging the company’s UI components library to modernize the interface and enhance usability. The app enables users to manage accounts, cards, and transactions, while providing seamless access to integrated financial services.",
    "contribution": "Contributed to the development of the new app version by mentoring a junior team and promoting agile and clean-code practices. Refactored major UI components such as card sliders and implemented new features, including a custom PDF reader and editor. Adopted VIPER architecture to enforce modularity and maintainability, supported by rigorous QA testing, pair programming, and peer code reviews.",
    "impact": "Delivered the redesigned app on schedule, fully aligned with CaixaBank’s design and usability standards. Improved modularity, reduced UI-related bugs, and enabled faster iteration cycles, leading to smoother user experiences and improved maintainability for future updates.",
    "logo": "logo_p3.webp",
    "images": [
      {
        "src": "image1_p3.png"
      },
      {
        "src": "image2_p3.png"
      },
      {
        "src": "image3_p3.png"
      }
    ],
    "video": "video_p3.mp4",
    "url": "https://play.google.com/store/apps/details?id=com.caixabankpc.nowpay"
  },
  {
    "id": "p4",
    "title": "OnTheSpot",
    "description": "A multimedia and marketing platform within Telefónica’s IoT division, serving over 50,000 clients across Spain. The system manages and controls real-time multimedia content for digital signage, interactive kiosks, and connected IoT devices across enterprise environments.",
    "contribution": "Modernized the Android app to ensure compatibility with newer Android versions and recently deployed hardware. Migrated large codebases from Java to Kotlin and refactored key modules to enhance performance and maintainability. Integrated VLC and native video players for robust media playback and leveraged IPC, MQTT, and multithreading to ensure reliable real-time content delivery.",
    "impact": "Improved app stability and performance by over 35% across multiple hardware configurations. The modernization reduced maintenance overhead and improved deployment agility, enabling Telefónica to scale its digital signage infrastructure efficiently across hundreds of client locations.",
    "logo": "logo_p4.webp",
    "images": [
      {
        "src": "image1_p4.jpg"
      },
      {
        "src": "image2_p4.jpg"
      },
      {
        "src": "image3_p4.jpg"
      }
    ],
    "url": "https://www.telefonicaempresas.es/grandes-empresas/blog/spotdyna-sistema-operativo-tiendas-conectadas/"
  },
  {
    "id": "p5",
    "title": "Fever App",
    "description": "An award-winning European platform for live entertainment, enabling users to discover and participate in real-time events and immersive experiences. The Android app delivers media-rich content, real-time updates, and interactive features to millions of users worldwide.",
    "contribution": "Developed new Android features using Kotlin, Jetpack Compose, and a hybrid MVVM–MVP architecture in a fast-paced production environment. Implemented automated testing integrated into the CI/CD pipeline to ensure consistent code quality. Collaborated with front-end and back-end teams to improve synchronization between client and API layers, reducing data inconsistencies and streamlining development.",
    "impact": "Reduced production issues and deployment time through continuous integration and automated testing. Improved the reliability of ticket and coupon purchase flows, reducing related support requests by 30%. The app operates as part of a platform reaching over 300 million monthly users across 40+ countries, reinforcing Fever’s reputation for stability, scalability, and user trust in high-traffic entertainment markets.",
    "logo": "logo_p5.webp",
    "images": [
      {
        "src": "image1_p5.jpg"
      },
      {
        "src": "image2_p5.jpg"
      },
      {
        "src": "image3_p5.jpg"
      }
    ],
    "video": "video_p5",
    "url": "https://play.google.com/store/apps/details?id=com.feverup.fever"
  }
]