[
    {
        "id": "p1",
        "title": "Renta 4 App",
        "description": "The main app of Renta 4 Bank, an investment bank specializing in capital markets and portfolio management. The app offers real-time quotes, financial news, and investment tools for managing funds, bonds, and market assets.",
        "contribution": "Collaborated with the dev team to deliver an MVP under a tight schedule. In the next phase, led the app’s evolution by implementing new features, enhancing the real-time data module, and reducing failures. In the final stage, oversaw the product delivery to the client, integrated a new team, and contributed to the Jetpack Compose migration.",
        "impact": "Achieved a 68% reduction in app failures, significantly enhancing user experience and overall stability. Resolved critical issues with real-time quotes, ensuring accurate and reliable data for users.",
        "logo": "logo_p1.webp",
        "images": [
            { "src": "image1_p1.jpg" },
            { "src": "image2_p1.jpg" },
            { "src": "image3_p1.jpg" }
        ],
        "video": "video_p1.mp4",
        "url": "https://play.google.com/store/apps/details?id=com.r4.renta4"
    },
    {
        "id": "p2",
        "title": "InOne App",
        "description": "A redesigned Caixabank Payments & Consumer app leveraging the company’s UI components library. This app allow users to manage accounts, cards, and transactions while providing seamless access to financial services. The redesign focused on enhancing usability and aligning with modern design standards..",
        "contribution": "Collaborated on developing the new version of the app, mentoring a young team to adopt agile practices and deliver an MVP under a tight deadline. Refactored UI components like card sliders and implemented features such as a PDF reader and editor. Employed VIPER architecture to ensure clean, modular code and adhered to strict code-quality standards through code reviews, pair programming, and continuous QA testing.",
        "impact": "Enhanced user experience with well-structured features and thorough testing. Successfully met client expectations by delivering the product redesign on time.",
        "logo": "logo_p2.webp",
        "images": [
            { "src": "image1_p2.png" },
            { "src": "image2_p2.png" },
            { "src": "image3_p2.png" }
        ],
        "video": "video_p2.mp4",
        "url": "https://play.google.com/store/apps/details?id=com.caixabankpc.nowpay"
    },
    {
        "id": "p3",
        "title": "OnTheSpot",
        "description": "A dynamic multimedia and marketing platform within the Telefónica IoT ecosystem, serving nearly 50,000 customers across Spain. The app manages and controls multimedia content in real-time, supporting digital signage, interactive kiosks, and various IoT devices with robust tools for dynamic content delivery.",
       "contribution": "Adapted the app for new Android versions, migrated legacy code from Java to Kotlin, and refactored large modules to improve maintainability. Leveraged technologies like broadcast receivers, IPC-MQTT, multi-threading, and dependency injection to ensure robust functionality. Integrated native and VLC video players to support varied media needs and enhanced real-time multimedia management.",
       "impact": "Improved stability and performance by 35% across multiple devices, ensuring compatibility with new Android versions and recently acquired hardware. Refactoring and careful optimization reduced maintenance overhead, leading to smoother user experiences and easier long-term support.",
       "logo": "logo_p3.webp",
        "images": [
            { "src": "image1_p3.jpg" },
            { "src": "image2_p3.jpg" },
            { "src": "image3_p3.jpg" }
        ],
        "url": "https://www.telefonicaempresas.es/grandes-empresas/blog/spotdyna-sistema-operativo-tiendas-conectadas/"
    },
    {
        "id": "p4",
        "title": "Fever App",
        "description": "An award-winning European app designed as a live entertainment platform, offering interactive experiences to engage users in real-time events. It leverages a robust Android implementation to deliver seamless live entertainment with real-time updates and rich media content.",
        "contribution": "Created new Android features in Kotlin using a hybrid MVVM-MVP architecture and Jetpack Compose in a fast-paced production environment. Contributed to building a high-coverage test harness and integrating it into the CI/CD pipeline. Maintained code quality through pair programming and thorough code reviews. In a full-stack capacity, facilitated collaboration between front-end and back-end teams to streamline development.",
        "impact": "Streamlined the deployment process and significantly reduced production issues through consistent testing and automated pipelines. Reduced inconsistencies in coupon purchases, improving reliability and user satisfaction.",
        "logo": "logo_p4.webp",
        "images": [
            { "src": "image1_p4.jpg" },
            { "src": "image2_p4.jpg" },
            { "src": "image3_p4.jpg" }
        ],
        "video": "video_p4",
        "url": "https://play.google.com/store/apps/details?id=com.feverup.fever"
    }
]